on a followup of the previous post.
1. i've updated to the latest docker image (```603a44a98794```) and latest localstack  (```pip install --upgrade --no-cache localstack localstack-ext localstack-client```) nad the latest terraform aws plugin (2.61)

2. no change in the config (can not imagine simpler), but this time, after killing the eternal loop of subnet creation, ran the ```terraform apply``` once again.

```
...
Stopping operation...
aws_subnet.localstack_vpc_subnet: Still creating... [40s elapsed]
^CTwo interrupts received. Exiting immediately. Note that data
loss may have occurred.

Error: operation canceled

(.localstack) [incze@hp6000 localstack-aws]$ terraform apply
aws_vpc.localstack_vpc: Refreshing state... [id=vpc-93465472]

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # aws_subnet.localstack_vpc_subnet will be created
  + resource "aws_subnet" "localstack_vpc_subnet" {
      + arn                             = (known after apply)
      + assign_ipv6_address_on_creation = false
      + availability_zone               = (known after apply)
      + availability_zone_id            = (known after apply)
      + cidr_block                      = "10.0.0.0/16"
      + id                              = (known after apply)
      + ipv6_cidr_block                 = (known after apply)
      + ipv6_cidr_block_association_id  = (known after apply)
      + map_public_ip_on_launch         = false
      + owner_id                        = (known after apply)
      + vpc_id                          = "vpc-93465472"
    }

  # aws_vpc.localstack_vpc will be updated in-place
  ~ resource "aws_vpc" "localstack_vpc" {
        arn                              = "arn:aws:ec2:us-east-1::vpc/vpc-93465472"
      ~ assign_generated_ipv6_cidr_block = true -> false
        cidr_block                       = "10.0.0.0/16"
        default_network_acl_id           = "acl-403466fb"
        default_route_table_id           = "rtb-36058a26"
        default_security_group_id        = "sg-d97ddbf4"
        dhcp_options_id                  = "dopt-7a8b9c2d"
        enable_classiclink               = false
        enable_classiclink_dns_support   = false
        enable_dns_hostnames             = false
        enable_dns_support               = true
        id                               = "vpc-93465472"
        instance_tenancy                 = "default"
      ~ ipv6_association_id              = "vpc-cidr-assoc-7a7761a1" -> (known after apply)
      ~ ipv6_cidr_block                  = "2400:6500:19fd:4aea::/56" -> (known after apply)
        main_route_table_id              = "rtb-36058a26"
        tags                             = {
            "Name" = "localstack_vpc"
        }
    }

Plan: 1 to add, 1 to change, 0 to destroy.

Do you want to perform these actions?
  Terraform will perform the actions described above.
  Only 'yes' will be accepted to approve.

  Enter a value: yes

aws_vpc.localstack_vpc: Modifying... [id=vpc-93465472]

Error: error waiting for EC2 VPC (vpc-93465472) IPv6 CIDR to become disassociated: couldn't find resource (2 retries)

  on localstack-aws.tf line 19, in resource "aws_vpc" "localstack_vpc":
  19: resource "aws_vpc" "localstack_vpc" {
```
so, after refreshing state

- terraform detected that the vpc was created with ipv6 cidr block, and registers to change it
- and registers to create the subnet.
- the 1st step fails (updating the vpc), with that interesting message (though, the resource should exist, as it could read it.)
- also, the terraform state became inconsistent:
````
.localstack) [incze@hp6000 localstack-aws]$ terraform show
# aws_vpc.localstack_vpc:
resource "aws_vpc" "localstack_vpc" {
    arn                              = "arn:aws:ec2:us-east-1::vpc/vpc-93465472"
    assign_generated_ipv6_cidr_block = false
    cidr_block                       = "10.0.0.0/16"
    default_network_acl_id           = "acl-403466fb"
    default_route_table_id           = "rtb-36058a26"
    default_security_group_id        = "sg-d97ddbf4"
    dhcp_options_id                  = "dopt-7a8b9c2d"
    enable_classiclink               = false
    enable_classiclink_dns_support   = false
    enable_dns_hostnames             = false
    enable_dns_support               = true
    id                               = "vpc-93465472"
    instance_tenancy                 = "default"
    ipv6_association_id              = "vpc-cidr-assoc-7a7761a1"
    ipv6_cidr_block                  = "2400:6500:19fd:4aea::/56"
    main_route_table_id              = "rtb-36058a26"
    tags                             = {
        "Name" = "localstack_vpc"
    }
}
```
(˙``assign_generated_ipv6_cidr_block=false```, but the ipv6 associations remain)

3. so, when reapplying the config the 3rd time, terraform decides that no change needed to the vpc (assign_generated_ipv6_cidr_block is now OK), and starts to create the subnet, and fails as before.

